# ArcAlignmentRegenFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ArcAlignmentRegenFailed Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't form arc alignment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArcAlignmentRegenFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcAlignmentRegenFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArcAlignmentRegenFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace